# imports

## Librairies

In [127]:
import numpy as np
import pandas as pd
import os

In [128]:
os.chdir('C:\\Users\\theos\\Documents\\ETUDES\\EDHEC_MSc\\data_visualization\\project_data_viz')

## Data

### import lieux

In [129]:
os.chdir('lieux')

In [130]:
file_list = list()
for file in os.listdir():
    df = pd.read_csv(file)
    file_list.append(df)
    
df_lieux = pd.concat(file_list, axis=0, ignore_index=True)
df_lieux.head()

C:\anaconda\lib\site-packages\IPython\core\interactiveshell.py:2785: DtypeWarning: Columns (2) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

,Num_Acc,catr,voie,v1,v2,circ,nbv,pr,pr1,vosp,prof,plan,lartpc,larrout,surf,infra,situ,env1
0,201000000001,3,39,NaN,NaN,2.0,2.0,0.0,0.0,0.0,1.0,1.0,0.0,60.0,1.0,0.0,1.0,0.0
1,201000000002,3,39,NaN,NaN,2.0,0.0,0.0,0.0,0.0,1.0,1.0,0.0,0.0,1.0,0.0,1.0,0.0
2,201000000003,3,41,2.0,NaN,2.0,2.0,0.0,0.0,0.0,1.0,1.0,0.0,61.0,1.0,0.0,1.0,0.0
3,201000000004,3,39,NaN,NaN,2.0,2.0,0.0,0.0,0.0,1.0,1.0,0.0,68.0,1.0,0.0,1.0,0.0
4,201000000005,3,239,NaN,NaN,2.0,1.0,0.0,0.0,0.0,1.0,1.0,0.0,0.0,1.0,0.0,1.0,99.0

### import vehicules

In [131]:
os.chdir('../vehicules')

In [132]:
file_list = list()
for file in os.listdir():
    df = pd.read_csv(file)
    file_list.append(df)
    
df_vehicules = pd.concat(file_list, axis=0, ignore_index=True)
df_vehicules.head()

        Num_Acc  senc  catv  occutc  obs  obsm  choc  manv num_veh
0  201000000001   0.0    30       0  1.0   0.0   1.0   1.0     A01
1  201000000002   0.0     7       0  0.0   1.0   1.0   1.0     A01
2  201000000003   0.0    33       0  0.0   2.0   1.0  17.0     A01
3  201000000003   0.0     7       0  0.0   9.0   3.0  23.0     C03
4  201000000003   0.0     7       0  0.0   9.0   6.0   1.0     B02

### import usagers

In [133]:
os.chdir('../usagers')

In [134]:
file_list = list()
for file in os.listdir():
    df = pd.read_csv(file)
    file_list.append(df)
    
df_usagers = pd.concat(file_list, axis=0, ignore_index=True)
df_usagers.head()

,Num_Acc,place,catu,grav,sexe,trajet,secu,locp,actp,etatp,an_nais,num_veh
0,201000000001,1.0,1,3,1,5.0,21.0,0.0,0.0,0.0,1976.0,A01
1,201000000002,1.0,1,1,2,5.0,11.0,0.0,0.0,0.0,1983.0,A01
2,201000000002,NaN,3,3,1,0.0,NaN,4.0,3.0,1.0,1965.0,A01
3,201000000003,1.0,1,3,1,5.0,23.0,0.0,0.0,0.0,1979.0,A01
4,201000000003,1.0,1,1,2,5.0,11.0,0.0,0.0,0.0,1959.0,C03

### import caracteristiques

In [135]:
os.chdir('../caracteristiques')

In [136]:
file_list = list()
for file in os.listdir():
    index_year = file.find('2')
    year = int(file[index_year:index_year+4])
    df = pd.read_csv(file,encoding = "ISO-8859-1")
    df['annee'] = year
    file_list.append(df)
    
df_caracteristiques = pd.concat(file_list, axis=0, ignore_index=True)
df_caracteristiques.head()

,Num_Acc,an,mois,jour,hrmn,lum,agg,int,atm,col,com,adr,gps,lat,long,dep,annee
0,201000000001,10,6,12,1930,1,2,1,1.0,6.0,52,71 RUE JEAN JAURES,M,0.0,0.0,590,2010
1,201000000002,10,8,7,1000,1,2,1,1.0,6.0,477,Rue Nationale,M,5051600.0,292000.0,590,2010
2,201000000003,10,9,11,1600,1,1,1,1.0,5.0,11,NaN,M,0.0,0.0,590,2010
3,201000000004,10,9,22,1630,1,2,1,1.0,6.0,477,43 rue Nationale,M,5051800.0,292500.0,590,2010
4,201000000005,10,10,25,1215,1,2,1,1.0,2.0,52,RUE GHESQUIERES,M,5050800.0,289700.0,590,2010

In [137]:
os.chdir('..')

### Nombre d'habitant par département

In [138]:
df_habitant = pd.read_excel('estimation-population-2017.xls')
df_habitant.head()

   code_insee code              departement  population
0          10   01                      Ain      643906
1          20   02                    Aisne      533679
2          30   03                   Allier      337439
3          40   04  Alpes-De-Haute-Provence      162473
4          50   05             Hautes-Alpes      141390

# Preparation data

## caracteristiques

In [139]:
# Selection useful columns
df_caracteristiques = df_caracteristiques.loc[:,['Num_Acc','jour','mois','lum','dep','atm','col','lat','long','annee']]

In [140]:
# create date
df_caracteristiques['date'] = df_caracteristiques['jour'].map(str) + '/' + df_caracteristiques['mois'].map(str) + '/' + df_caracteristiques['annee'].map(str)

In [141]:
# lattitude
#df_caracteristiques['lat'] = df_caracteristiques['lat'].apply(lambda x: x/100000)
df_caracteristiques['lat'] = df_caracteristiques['lat'].div(100000)

In [142]:
# longitude
df_caracteristiques['long'] = df_caracteristiques['long'].div(100000)

In [143]:
df_caracteristiques = df_caracteristiques.drop(columns=['jour','mois'])

In [144]:
df_caracteristiques[['atm','col']] = df_caracteristiques[['atm','col']].astype('Int64')

In [145]:
df_caracteristiques.loc[df_caracteristiques['lat']==0,'lat']=np.nan
df_caracteristiques.loc[df_caracteristiques['long']==0,'long']=np.nan

In [146]:
df_caracteristiques.head()

        Num_Acc  lum  dep  atm  col     lat   long  annee        date
0  201000000001    1  590    1    6     NaN    NaN   2010   12/6/2010
1  201000000002    1  590    1    6  50.516  2.920   2010    7/8/2010
2  201000000003    1  590    1    5     NaN    NaN   2010   11/9/2010
3  201000000004    1  590    1    6  50.518  2.925   2010   22/9/2010
4  201000000005    1  590    1    2  50.508  2.897   2010  25/10/2010

## lieux

In [147]:
df_lieux = df_lieux.loc[:,['Num_Acc','plan']]

In [148]:
df_lieux[['plan']] = df_lieux[['plan']].astype('Int64')

In [149]:
df_lieux.head()

        Num_Acc  plan
0  201000000001     1
1  201000000002     1
2  201000000003     1
3  201000000004     1
4  201000000005     1

## vehicules

In [150]:
df_vehicules = df_vehicules.loc[:,['Num_Acc','catv']]

In [151]:
df_vehicules.head()

        Num_Acc  catv
0  201000000001    30
1  201000000002     7
2  201000000003    33
3  201000000003     7
4  201000000003     7

## usagers

In [152]:
df_usagers = df_usagers.loc[:,['Num_Acc','num_veh','grav']]

In [153]:
df_usagers.head()

        Num_Acc num_veh  grav
0  201000000001     A01     3
1  201000000002     A01     1
2  201000000002     A01     3
3  201000000003     A01     3
4  201000000003     C03     1

## Creation datatable view by vehicule and accident

In [154]:
data = pd.merge(df_usagers, df_vehicules, how='left',on=['Num_Acc'])

In [155]:
data['indemne'], data['tue'],data['blesse_hospitalise'], data['blesse_leger']=[0, 0, 0, 0]
data.loc[data['grav']==1,'indemne'] = 1
data.loc[data['grav']==2,'tue'] = 1
data.loc[data['grav']==3,'blesse_hospitalise'] = 1
data.loc[data['grav']==4,'blesse_leger'] = 1

There are mistakes in the data. We can see that some accidents for the same vehicule, do not have the same category of vehicule (catv).

In [156]:
data = data.groupby(['Num_Acc','num_veh']).agg({'indemne':'sum',
                                              'tue':'sum',
                                              'blesse_hospitalise':'sum',
                                              'blesse_leger':'sum',
                                              'catv':'first',})

In [157]:
data.reset_index(inplace=True)

In [158]:
data['max_grav'] = 1
# Maximum gravity in the accident 2 > 3 > 4 > 1
data.loc[data['tue'] > 0, 'max_grav'] = 2
data.loc[((data['tue'] <= 0) & (data['blesse_hospitalise'] > 0)), 'max_grav'] = 3
data.loc[((data['tue'] <= 0) & (data['blesse_hospitalise'] <= 0) & (data['blesse_leger'] > 0)), 'max_grav'] = 4

In [159]:
data.head(10)

,Num_Acc,num_veh,indemne,tue,blesse_hospitalise,blesse_leger,catv,max_grav
0,201000000001,A01,0,0,1,0,30,3
1,201000000002,A01,1,0,1,0,7,3
2,201000000003,A01,0,0,3,0,33,3
3,201000000003,B02,3,0,0,0,33,1
4,201000000003,C03,3,0,0,0,33,1
5,201000000004,A01,0,0,2,0,1,3
6,201000000004,B02,2,0,0,0,1,1
7,201000000005,A01,0,0,2,0,2,3
8,201000000005,B02,2,0,0,0,2,1
9,201000000006,A01,5,0,0,0,7,1

In [160]:
data.head(5)

,Num_Acc,num_veh,indemne,tue,blesse_hospitalise,blesse_leger,catv,max_grav
0,201000000001,A01,0,0,1,0,30,3
1,201000000002,A01,1,0,1,0,7,3
2,201000000003,A01,0,0,3,0,33,3
3,201000000003,B02,3,0,0,0,33,1
4,201000000003,C03,3,0,0,0,33,1

## Join the dataframes

In [161]:
data = pd.merge(data, df_caracteristiques, how='left',on=['Num_Acc'])

In [162]:
data = pd.merge(data, df_lieux, how='left',on=['Num_Acc'])

In [163]:
data = pd.merge(data, df_habitant, how='left', left_on=['dep'], right_on=['code_insee'])

In [164]:
data.head()

,Num_Acc,num_veh,indemne,tue,blesse_hospitalise,blesse_leger,catv,max_grav,lum,dep,...,col,lat,long,annee,date,plan,code_insee,code,departement,population
0,201000000001,A01,0,0,1,0,30,3,1,590,...,6,NaN,NaN,2010,12/6/2010,1,590,59,Nord,2601785
1,201000000002,A01,1,0,1,0,7,3,1,590,...,6,50.516,2.92,2010,7/8/2010,1,590,59,Nord,2601785
2,201000000003,A01,0,0,3,0,33,3,1,590,...,5,NaN,NaN,2010,11/9/2010,1,590,59,Nord,2601785
3,201000000003,B02,3,0,0,0,33,1,1,590,...,5,NaN,NaN,2010,11/9/2010,1,590,59,Nord,2601785
4,201000000003,C03,3,0,0,0,33,1,1,590,...,5,NaN,NaN,2010,11/9/2010,1,590,59,Nord,2601785

In [165]:
data.drop(columns=["Num_Acc","dep","code_insee","annee"], inplace=True)

In [166]:
data.shape

(829926, 17)

In [167]:
for column in data.columns:
    na = sum(data[column].isna())
    print('{}: {}'.format(column,na))

num_veh: 0
indemne: 0
tue: 0
blesse_hospitalise: 0
blesse_leger: 0
catv: 0
max_grav: 0
lum: 0
atm: 97
col: 28
lat: 444573
long: 444771
date: 0
plan: 3156
code: 0
departement: 0
population: 0

In [168]:
# The 97 values missing for the condition 'atm' are filled with 'normal'=1
data['atm'].fillna(1,inplace=True)

## Remove the latittude and longitude without sense

In [169]:
data2 = data.copy()
data2.dropna(axis=0,how='any',subset=['lat','long'],inplace=True)  # dropna
data2.head()

,num_veh,indemne,tue,blesse_hospitalise,blesse_leger,catv,max_grav,lum,atm,col,lat,long,date,plan,code,departement,population
1,A01,1,0,1,0,7,3,1,1,6,50.516,2.920,7/8/2010,1,59,Nord,2601785
5,A01,0,0,2,0,1,3,1,1,6,50.518,2.925,22/9/2010,1,59,Nord,2601785
6,B02,2,0,0,0,1,1,1,1,6,50.518,2.925,22/9/2010,1,59,Nord,2601785
7,A01,0,0,2,0,2,3,1,1,2,50.508,2.897,25/10/2010,1,59,Nord,2601785
8,B02,2,0,0,0,2,1,1,1,2,50.508,2.897,25/10/2010,1,59,Nord,2601785

In [170]:
data2 = data2.groupby('departement').agg({'lat':['mean', 'std'], 
                         'long':['mean','std']})
data2.reset_index(inplace=True,drop=False)
data2.columns = ['departement','lat_mean','lat_std','long_mean','long_std']

In [171]:
data = pd.merge(data, data2,how='left',on='departement')

In [172]:
data['sigma_interval_lat']= (data['lat']-data['lat_mean'])/data['lat_std']
data['sigma_interval_long']= (data['long']-data['long_mean'])/data['long_std']

In [173]:
data.loc[data['sigma_interval_lat']>5,'lat']=np.nan
data.loc[data['sigma_interval_long']>5,'long']=np.nan
data.loc[data['sigma_interval_lat']<-5,'lat']=np.nan
data.loc[data['sigma_interval_long']<-5,'long']=np.nan

In [174]:
#data[(data['departement']=='Sarthe') & (data['lat']<43)]

In [175]:
data = data.loc[:,:'population']

In [176]:
data.reset_index(inplace=True, drop=False)

In [177]:
data.rename(columns={'index':'id_vehicule'}, inplace=True)

In [178]:
data.head()

,id_vehicule,num_veh,indemne,tue,blesse_hospitalise,blesse_leger,catv,max_grav,lum,atm,col,lat,long,date,plan,code,departement,population
0,0,A01,0,0,1,0,30,3,1,1,6,NaN,NaN,12/6/2010,1,59,Nord,2601785
1,1,A01,1,0,1,0,7,3,1,1,6,50.516,2.92,7/8/2010,1,59,Nord,2601785
2,2,A01,0,0,3,0,33,3,1,1,5,NaN,NaN,11/9/2010,1,59,Nord,2601785
3,3,B02,3,0,0,0,33,1,1,1,5,NaN,NaN,11/9/2010,1,59,Nord,2601785
4,4,C03,3,0,0,0,33,1,1,1,5,NaN,NaN,11/9/2010,1,59,Nord,2601785

## Modify a little bit lat and long to plot them on the map separately

In [179]:
np.random.normal(loc=0.0, scale=0.00001)

-1.751927155982535e-05

In [180]:
data_test = data.copy()

In [181]:
data_test.head()

,id_vehicule,num_veh,indemne,tue,blesse_hospitalise,blesse_leger,catv,max_grav,lum,atm,col,lat,long,date,plan,code,departement,population
0,0,A01,0,0,1,0,30,3,1,1,6,NaN,NaN,12/6/2010,1,59,Nord,2601785
1,1,A01,1,0,1,0,7,3,1,1,6,50.516,2.92,7/8/2010,1,59,Nord,2601785
2,2,A01,0,0,3,0,33,3,1,1,5,NaN,NaN,11/9/2010,1,59,Nord,2601785
3,3,B02,3,0,0,0,33,1,1,1,5,NaN,NaN,11/9/2010,1,59,Nord,2601785
4,4,C03,3,0,0,0,33,1,1,1,5,NaN,NaN,11/9/2010,1,59,Nord,2601785

In [182]:
np.random.normal(loc=0.0, scale=0.00001, size=2)

array([1.66291871e-05, 3.60644288e-06])

In [183]:
data_test.loc[data_test['lat'].notna(),'lat'].shape[0]

384856

### lat

In [184]:
length_notna = data.loc[data['lat'].notna(),'lat'].shape[0]
random_numbers = np.random.normal(loc=0.0, scale=0.00003, size=length_notna)
data.loc[data['lat'].notna(),'lat'] = data.loc[data['lat'].notna(),'lat'] + random_numbers

### long

In [185]:
length_notna = data.loc[data['long'].notna(),'long'].shape[0]
random_numbers = np.random.normal(loc=0.0, scale=0.00003, size=length_notna)
data.loc[data['long'].notna(),'long'] = data.loc[data['long'].notna(),'long'] + random_numbers

# Export the data

In [186]:
data.head()

,id_vehicule,num_veh,indemne,tue,blesse_hospitalise,blesse_leger,catv,max_grav,lum,atm,col,lat,long,date,plan,code,departement,population
0,0,A01,0,0,1,0,30,3,1,1,6,NaN,NaN,12/6/2010,1,59,Nord,2601785
1,1,A01,1,0,1,0,7,3,1,1,6,50.51601,2.920024,7/8/2010,1,59,Nord,2601785
2,2,A01,0,0,3,0,33,3,1,1,5,NaN,NaN,11/9/2010,1,59,Nord,2601785
3,3,B02,3,0,0,0,33,1,1,1,5,NaN,NaN,11/9/2010,1,59,Nord,2601785
4,4,C03,3,0,0,0,33,1,1,1,5,NaN,NaN,11/9/2010,1,59,Nord,2601785

In [187]:
data.shape

(829926, 18)

In [188]:
data.to_csv('data.csv',sep='\t')

In [189]:
print("Done")

Done